# Напишите программу, которая бы находила решение следующего линейного уравнения: ax + b = 0
# (Гарантируется что а не равно 0, сначала на вход подается a затем b)
a = int(input())
b = int(input())
x = (0 - b) / a
print(x)
