# Напишите программу которая бы по очереди считывала три цифры из ввода
# и составляла из них число просто поставив их рядом с друг другом.
# (Гарантируется, что первое число не 0)
one = input()
two = input()
three = input()
result = int(one + two + three)
print(result)
