# Напишите программу, которая отвечала бы на следующий вопрос:
# какое число стоит в десятичном разряде введенного числа? (Гарантируется, что число больше 9)
one = int(input())
print(str(one)[-2])
