# Напишите программу, которая считывала бы имя человека,
# а затем его возраст и выдавала строку, как в примерах
name = input()
age = input()
print(name + " is " + age + " years old")
